module ApplicationHelper

  def links 
    {a:["ア","イ","ウ","エ","オ"],
    ka:["カ","キ","ク","ケ","コ"],
    sa:["サ","シ","ス","セ","ソ"],
    ta:["タ","チ","ツ","テ","ト"],
    na:["ナ","ニ","ヌ","ネ","ノ"],
    ha:["ハ","ヒ","フ","ヘ","ホ"],
    ma:["マ","ミ","ム","メ","モ"],
    ya:["ヤ","","ユ","","ヨ"],
    ra:["ラ","リ","ル","レ","ロ"],
    wa:["","","ワ","",""]
    }
  end

  def race_title
    @race_title = [
      "開催日","競馬場","R","レース名","コース","馬場","頭数","枠番","馬番",
      "オッズ","人気","着順","性•歳","斤量","騎手","調教師","馬体重","タイム",
      "着差","上がり(3F)","通過","勝馬(2着馬)",
     ]
  end

end
